import Container from "../../design/Container"
import Title from "../../design/title"
import { Link } from "react-router-dom";
import { GoArrowLeft } from "react-icons/go";
import image from '../../assets/male-doctor.webp'
function Advice() {
    return (
        <Container className="m-3 p-4" >
            <div className="flex justify-between items-center">
                <Title text="بعض النصائح الطبية قد تهمك" className="p-3" />
                <Link to="/patient/medical-advices" className="flex gap-4  text-blue-600 ">
                    <p className="text-center ">العودة للسابق</p>
                    <GoArrowLeft className="w-7 h-7 text-center" />
                </Link>
            </div>
            <div className="flex gap-5 justify-center border-4 border-gray-200 p-4 rounded-xl">
                <img src={image} alt="image-article" className="w-1/3 h-fit" />
                <div>
                    <h3 className="font-bold text-5xl p-4">لام التعريف :</h3>
                    <p>
                        تصنيف
                        لام التعريف بحسب المعنى:

                        عهدية
                        جنسية
                        استغراقية
                        تأتي كذلك:

                        اسما موصولا بمعنى الذي
                        زائدة وهي على نوعين: زائدة لازمة وزائدة غير لازمة
                        بدلا عن المضاف إليه
                        غير دالة على التعريف.
                        همزة أل
                        في الكتابة العربية الحديثة، تحذف همزة أل التعريف عندما يتصل الاسم المعرف بحرف الجر أللام على نحو: التعريف ← للتعريف.

                        لام أل
                        لام التعريف الأداة
                        تدخل لام التعريف على الأسماء كي تعرفها وتزيل إمكان اللبس في المقصد من الاسم المعرف.

                        قبل دخول لام التعريف	بعد دخول لام التعريف
                        رَأَيْتُ رَجُلًا يَدْخُلُ بَيْتًا.	رَأَيْتُ ٱلرَّجُلَ يَدْخُلُ ٱلْبَيْتَ.
                        دخلت لام التعريف على كل من الاسمين: رجل وبيت؛ وأزالت بدخولها اللبس في دلالة هذين الاسمين، ليشيرا إلى بيت ورجل محددين ومعرفين.

                        إن دخول لام التعريف على الاسم لم يغير من حالته الإعرابية؛ إنما أدى فقط إلى إزالة تنوين الاسم النكرة وتعيين المقصد منه.
                        تنقسم لام التعريف بحسب المعنى إلى:

                        1- لام عهدية:	اِشْتَرَيْتُ دَفْتَرًا ثُمَّ بِعْتُ الدَّفْتَرَ.
                        2- لام جنسية:	وَخُلِقَ الْإِنْسَانُ ضَعِيفًا.
                        شاع استخدام لام التعريف بالمعنى العهدي؛ لكن جاز استخدامها أيضا بالمعنى الجنسي كما هو الحال عند تعريف الاسم: إنسان، ليصبح: الإنسان، والذي يشير هنا إلى مجموع أفراد هذا الجنس.

                        لام التعريف الاسم موصول
                        تأتي لام التعريف اسما موصولا بمعنى الذي وفروعه، وتدخل على الأسماء المشتقة كاسم الفاعل أو اسم المفعول أو الصفة المشبهة.
                        مثال:
                        مِنَ ٱلْقَوْمِ ٱلرَّسُولُ ٱللَّهِ مِنْهُمْ لَهُمْ دَانَتْ رِقَابُ بَنِي مَعَدٍّ
                        المقصد هنا:
                        مِنَ ٱلْقَوْمِ ٱلَّذِينَ رَسُولُ ٱللَّهِ مِنْهُمْ دَانَتْ رِقَابُ بَنِي مَعَدٍّ.

                        لام التعريف الزائدة
                        يمكن لـ لام التعريف أن تأتي زائدة وهي نوعان:

                        زائدة لازمة: تدخل على الأسماء الموصولة كالذي؛ التي؛ اللذان؛ اللتان.
                        زائدة لازمة: كاللات واليسع أو في الإشارة: الآن

                        زائدة غير لازمة: تدخل على أسماء العلم مثال: الحارث؛ العباس.وهذا النوع من الزيادة سماعي.
                        وقد تحذف في غير السماع: (وهذا يوم اثنين مباركا فيه)

                        لام التعريف البدل عن المضاف إليه
                        يحتاج تحديد فيما إذا كانت لام التعريف بدل من المضاف إليه إلى التفكر والإبحار في المعنى من الاسم الوارد المعرف.
                        مثالا:
                        قَالَتْ بَنَاتُ ٱلْعَمِّ: يَا سَلْمَى وَإِنْ كَانَ فَقِيرًا مُعْدِمًا قَالَتْ: وَإِنْ
                        إن تقدير بَنَاتُ ٱلْعَمِّ في هذا البيت الشعري: بَنَاتُ عَمِّي—هنا جاءت لام التعريف بَدَلًا من المضاف إليه ضمير الملكية (ـ).

                        لام التعريف غير الدالة عليه
                        إن الأصل في لام التعريف الدلالة على اسم معرف ومحدد إلا أنها تفقد هذه الفائدة في التعريف والتحديد عندما تتصل ببعض الأسماء
                        مثالا:
                        يَقُولُ ٱلطِّفْلُ: سَأُصْبِحُ ٱلْغَدَ طَبِيبًا
                        إن المقصد من كلمة الغد هنا، ليس الغد بالمعنى الحرفي للكلمة وإنما بمعنى المستقبل، فيجوز القول بأن كلمة الغد؛ بالرغم من أنها معرفة، إلا أنها ما زالت مطلقة مشيرة إلى مستقبل غير محدد.

                        اللام الشمسية واللام القمرية

                        س	ز	ر	ذ	د	ث	ت
                        ن	ل	ظ	ط	ض	ص	ش
                        غ	ع	خ	ح	ج	ب	ا
                        ي	و	ه	م	ك	ق	ف
                        في أغلب الأحيان تُوصف الحروف بأنها حروف شمسية أو حروف قمرية ولكن في بعض الأحيان تُوصف اللام (يقصد بها حرف اللام في أل التعريف) بأنها شمسية أو قمرية.

                        اللام القمرية
                        التعريف : هي اللام التي تُكتب وتُلفظ، ويكون الحرفُ الذي بعدها غير مُشدد. المثال : الْــعلم ـ الْــقلم ـ الْــكلا - القَمر - الأسد ملك الغابة - الـبدر منير - الجمل سفينة الصحراء - العلم نافع - الحلم سيد الأخلاق - الخميلة خضراء - الغيرة تولد الحقد - الفناء واسع - القلب نابض - الكتاب جديد - المسلمون يطوفون بالبيت الحرام - الهواء عليل - الورد متفتح - الياسمين رائحته زكية.

                        حروف (الـ) القمرية : (ا ـ ب ـ ج ـ ح ـ خ ـ ع ـ غ ـ ف ـ ق ـ ك ـ م ـ هـ ـ وـ ي)
                        وهي مجتمعة في هذه الجملة :
                        (ابغ حجك وخف عقيمه) الحرف الكلمة إضافة أل القمرية أ أَبٌ الأَبُ ب بَلَدٌ البَلَدُ ج جَمَلٌ الجَمَلُ ح حَمَلٌ الحَمَلُ خ خَرُوفٌ الخَرُوفُ ع عَيْنٌ العَيْنُ غ غُلامٌ الغُلامُ ف فَاسٌ الفَاسُ ق قَمَرٌ القَمَرُ ك كِتَابٌ الكِتَابُ م مَاءٌ المَاءُ هـ هِرٌّ الهِرُّ و وَلَدٌ الوَلَدُ ي يد اليد
                        اللام الشمسية
                        التعريف هي التي تكتب ولا تلفظ (لأنها تدغم بالحرف الذي بعدها، فيكتب الحرف الذي بعدها مشددًا). المثال : (التُّفاح ـ الذَّهب ـ الصِّدق ـ الـطَّعام - الـشَّمس)

                        وقوله تعالى : «والسَّماء والطَّأرق». و : الشَّمس مشرقة - الرَّجل قادم - التَّمر طعام مفيد - الثِّمار ناضجة. الصَّياد متأهب - نقيق الضَّفادع مزعج - الذُّل مكروه - الطُّيور مغردة -النُّور ساطع - الدِّفاع عن الوطن واجب - اللَّيمون حامض أو حلو - الظُّلم ظلمات يوم القيامة - يتفتح الزُّهر في الرَّبيع - السَّلام عليكم

                        حروف (الـ) الشمسية : (ت ـ ث ـ د ـ ذ ـ ر ـ زـ س ـ ش ـ ص ـ ض ـ ط ـ ظ ـ ل ـ ن)
                        وهي مجتمعة في أوائل البيت :
                        طب ثم صل رحما تفز، ضف ذا نعم دع ســوء ظــنٍ، زر شـريفـا للكرم

                        الحرف الكلمة إضافة أل الشمسية ت تُّفاح الــتُّفاح ث ثُّعلب الــثُّعلب د دِّفاع الــدِّفاع ذ ذَّهب الــذَّهب ر رَّبيع الــرَّبيع ز زُّهر الــزُّهر س سُّماء الــسُّماء ش شَّمس الــشَّمس ص صَّديق الــصَّديق ض ضُّبع الــضُّبع ط طَّالب الــطَّالب ظ ظُّبي الــظُّبي ل لَّيمون الـلَّيمون ن نَّافذة الــنَّافذة

                        المبدوء بـ (لام)
                        - ما كان مبدوءًا بلام في الأصل، ثم دخلت عليه (الـ) يصبح بلامين. مثل : لغة+ الـ = اللغة. مثل الكلمات التالية: لقمة ـ اللقمة، لظى ـ اللظى، لجام ـ اللجام، لب ـ اللب، لون ـ اللون، لوح ـ اللوح.

                        - تحذف همزة الوصل من «أل» إذا دخلت عليها لام الجر فيجتمع ثلاث لامات، وتجنبًا لصعوبة الكتابة ، يمكن أن تدغم لام التعريف في اللام الأصلية، ويعوض عنها بالشدة التي توضع فوق اللام الثانية. مثل: : لبن + الـ = اللبن + لـ (حرف جر) = للَّبن.

                        مثل الكلمات: المعلم ـ للمعلم، الدهون ـ للدهون ،الخالق ـ للخالق.

                        المراجع</p>
                </div>
            </div>
        </Container>
    )
}

export default Advice
